# 扔鸡蛋的问题

# 有100层楼, 2枚相同的鸡蛋. 要测试鸡蛋的强度(在第n层摔碎, 而前n-1层不碎), 求解最差情况下需要扔鸡蛋的次数.
# 如果只有1枚鸡蛋, 则只能从1开始往上尝试. 而有2枚鸡蛋的情况下, 假设2枚鸡蛋最小尝试次数为x次, 则第一次从第x层开始扔. 如果摔碎了, 则剩下的鸡蛋需要从1楼开始尝试, 直到x-1层, 两枚鸡蛋一共扔了x次. 
# 若没有摔碎, 则第一枚鸡蛋继续在第x层到100层之间尝试, 设为第y层. 若此次摔碎了, 则第二枚从x+1层开始, 直到y-1层. 要使得尝试的次数仍然为x次, 则有:
# (y-1)-(x+1)+1=x-2, 即y=x+(x-1). 以此类推, 如果第一枚鸡蛋一直不碎, 尝试楼层应该是x, x+(x-1), x+(x-1)+(x-2) ... 一直到第100层.
# 即 x+(x+(x-1))+(x+(x-1)+(x-2))+ ... + 2+1 = 100, 即(x+1)*x=100, 向上取整x=14.


# 推广到H层, N枚鸡蛋的情况

# 假设第H层, N枚鸡蛋剩余的最优解为F(H, N), 在第x层尝试(1<=x<H). 则问题可以分解为:
# 摔碎了: F(H, N)=F(x-1, N-1)+1
# 没摔碎: F(H, N)=F(H-x, N-1)+1 注意: 从第x+1到第H层的问题, 可以看作从1楼到第H-x楼
# 可以得到状态转移方程:
# F(H, N) = Min{(1<=x<=H-1)Max{F(x-1, N-1), F(H-x, N-1)}+1}

